# Data Wrangling with Pandas

**Author**: Jeremy Maurer - Missouri University of Science and Technology

This notebook provides an overview of data manipulation using Pandas, a Python package that provides similar functionality to spreadsheet programs like Excel or Google Sheets.

In this notebook we will briefly demonstrate the following capabilities of pandas:
- Reading data from comma and space-delimited files into pandas dataframes
- Manipulating data in a dataframe
- Writing dataframes to files

<div class="alert alert-info">
    <b>Terminology:</b>    

- *dataframe*: The equivalent of a spreadsheet in Python.
    
- *Series*: A single column of a Pandas dataframe; equivalent to a column in a spreadsheet  

- *tropospheric zenith delay*: The precise atmospheric delay satellite signals experience when propagating through the troposphere.  
</div>

## Table of Contents:
<a id='example_TOC'></a>

[**Overview of the pandas package**](#overview)
- [1. Reading data from files](#overview_1)
- [2. Manipulating data in dataframes](#overview_2)
- [3. Writing data to files](#overview_3)

[**Manipulating RAiDER data in Pandas**](#examples)
- [Example 1. Generate all individual station scatter-plots, as listed under section #4](#example_1)
- [Example 2. Generate all basic gridded station plots, as listed under section #5](#example_2)

## Prep: Initial setup of the notebook

Below we set up the directory structure for this notebook exercise. In addition, we load the required modules into our python environment using the **`import`** command.

In [3]:
import numpy as np
import os
import matplotlib.pyplot as plt
import pandas as pd

## Defining the home and data directories
tutorial_home_dir = os.path.abspath(os.getcwd())
work_dir = os.path.abspath(os.getcwd())
print("Tutorial directory: ", tutorial_home_dir)
print("Work directory: ", work_dir)

Tutorial directory:  /Users/jeremym/software/RAiDER-docs/notebooks/Pandas_tutorial
Work directory:  /Users/jeremym/software/RAiDER-docs/notebooks/Pandas_tutorial

In [25]:
# Let's start by loading a simple .csv dataset into a pandas dataframe 
df = pd.read_csv('sample_data.csv')
df.head()

              Datetime    ID      Lat      Lon     Hgt_m     ZTD
0  2019-01-09 06:00:00  1LSU  30.4074 -91.1803    -6.487  2.4517
1  2019-01-09 06:00:00  1NSU  31.7508 -93.0976    28.071  2.3984
2  2019-01-09 06:00:00  1ULM  32.5290 -92.0759    16.000  2.3861
3  2019-01-09 06:00:00  AACR   9.9388 -84.1179  1123.929  2.1691
4  2019-01-09 06:00:00  ABE1  16.4720 -61.5093   -17.198  2.5406

In [26]:
# It's also possible to read space-delimited and excel files using pandas 
# df = pd.read_csv('space_delimited_file.txt', delim_whitespace=True)
# df = pd.read_excel('excel_file.xlsx') # You may need to install xlrd or openpyxl to read excel files

In [27]:
# Pandas uses an "index" to keep track of rows. By default it uses integers
print(df.index)

RangeIndex(start=0, stop=94549, step=1)

In [28]:
# You can change the index to a column in the dataframe, for example a datetime
df = df.set_index('Datetime')
df.head()

                       ID      Lat      Lon     Hgt_m     ZTD
Datetime
2019-01-09 06:00:00  1LSU  30.4074 -91.1803    -6.487  2.4517
2019-01-09 06:00:00  1NSU  31.7508 -93.0976    28.071  2.3984
2019-01-09 06:00:00  1ULM  32.5290 -92.0759    16.000  2.3861
2019-01-09 06:00:00  AACR   9.9388 -84.1179  1123.929  2.1691
2019-01-09 06:00:00  ABE1  16.4720 -61.5093   -17.198  2.5406

In [29]:
# You can reset the index as well
df = df.reset_index()
df.head()

              Datetime    ID      Lat      Lon     Hgt_m     ZTD
0  2019-01-09 06:00:00  1LSU  30.4074 -91.1803    -6.487  2.4517
1  2019-01-09 06:00:00  1NSU  31.7508 -93.0976    28.071  2.3984
2  2019-01-09 06:00:00  1ULM  32.5290 -92.0759    16.000  2.3861
3  2019-01-09 06:00:00  AACR   9.9388 -84.1179  1123.929  2.1691
4  2019-01-09 06:00:00  ABE1  16.4720 -61.5093   -17.198  2.5406

In [30]:
# By default Pandas reads datetimes from files as strings.
# we can convert them to actual Python datetimes 
df['Datetime'] = pd.to_datetime(df['Datetime'])
df = df.set_index('Datetime')
df.head()

                       ID      Lat      Lon     Hgt_m     ZTD
Datetime
2019-01-09 06:00:00  1LSU  30.4074 -91.1803    -6.487  2.4517
2019-01-09 06:00:00  1NSU  31.7508 -93.0976    28.071  2.3984
2019-01-09 06:00:00  1ULM  32.5290 -92.0759    16.000  2.3861
2019-01-09 06:00:00  AACR   9.9388 -84.1179  1123.929  2.1691
2019-01-09 06:00:00  ABE1  16.4720 -61.5093   -17.198  2.5406

In [31]:
# We can get a subset of the data using the column name
df_jme2 = df[df['ID'] == 'JME2']
df_jme2.head()

                       ID     Lat      Lon  Hgt_m     ZTD
Datetime
2019-01-09 06:00:00  JME2  18.235 -72.5384 -8.439  2.5576
2019-01-21 06:00:00  JME2  18.235 -72.5384 -8.439  2.5270
2019-02-02 06:00:00  JME2  18.235 -72.5384 -8.439  2.5204
2019-02-14 06:00:00  JME2  18.235 -72.5384 -8.439  2.5530
2019-02-26 06:00:00  JME2  18.235 -72.5384 -8.439  2.5139

In [ ]:
# It's possible to plot data directly using Pandas
ax = df_jme2['ZTD'].plot(marker='.')
ax.set_xticks(df.index)
ax.set_xticklabels(df.index, rotation=45)
plt.show()